
## Plan Result (sandbox)




<pre><code>Plan: 1 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.test-secret
* Update
  * module.plum-redis-storage.azurerm_private_endpoint.this[0]
  * module.plum-redis-storage.azurerm_redis_cache.redis
  * module.plum-redis-storage.azurerm_resource_group.cache-resourcegroup[0]
  * module.plum-redis-storage.azurerm_storage_account.backup[0]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_resource_group.rg[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.test-secret will be created
  + resource "azurerm_key_vault_secret" "test-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-shared-infrastructure-sandbox/providers/Microsoft.KeyVault/vaults/crumblesi-sandbox"
      + name                    = "test-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.plum-redis-storage.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Network/privateEndpoints/crumble-recipe-backend-session-storage-sandbox"
        name                          = "crumble-recipe-backend-session-storage-sandbox"
      ~ tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.plum-redis-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Cache/redis/crumble-recipe-backend-session-storage-sandbox"
        name                          = "crumble-recipe-backend-session-storage-sandbox"
      ~ tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ rdb_storage_connection_string           = (sensitive value)
            # (16 unchanged attributes hidden)
        }
    }

  # module.plum-redis-storage.azurerm_resource_group.cache-resourcegroup[0] will be updated in-place
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id         = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox"
        name       = "crumble-recipe-backend-session-storage-cache-sandbox"
      ~ tags       = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (2 unchanged attributes hidden)
    }

  # module.plum-redis-storage.azurerm_storage_account.backup[0] will be updated in-place
  ~ resource "azurerm_storage_account" "backup" {
        id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-recipe-backend-session-storage-cache-sandbox/providers/Microsoft.Storage/storageAccounts/crumblesandboxredissa"
        name                              = "crumblesandboxredissa"
      ~ tags                              = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (63 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/crumble-v14-flexible-sandbox"
        name                          = "crumble-v14-flexible-sandbox"
      ~ tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/crumble-v14-flexible-data-sandbox"
        name       = "crumble-v14-flexible-data-sandbox"
      ~ tags       = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
          ~ "expiresAfter"        = "2024-05-19" -> "2024-05-22"
            "managedBy"           = "CNP"
            "startupMode"         = "onDemand"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":941,"Program":"tfcmt","SHA1":"","Target":"sandbox","Vars":{}} -->